In [1]:
import pandas as pd
import numpy as np

In [22]:
col_names=['name', 'gender']

In [10]:
df=pd.read_csv("bank_customer_names.csv")
df.sample(4)

        Surname Gender
538   Chijindum   Male
547       Trout   Male
370        Huie   Male
1811  Flannagan   Male

In [11]:
df.Gender.unique()

array(['Female', 'Male'], dtype=object)

In [12]:
df.Gender=df.Gender.apply(lambda x: 0  if x.strip()=='Female' else 1)

In [23]:
df.columns=col_names
df.head()

       name  gender
0  Hargrave       0
1  Bartlett       1
2    Bearce       1
3   Goforth       1
4     Romeo       1

### new

In [14]:
df1=pd.read_csv("Indian-Female-Names.csv")
df1.sample(4)

             name gender    race
12857  shukramani      f  indian
6566       archna      f  indian
3222         soni      f  indian
8313        mamta      f  indian

In [15]:
df2=pd.read_csv("Indian-Male-Names.csv")
df2.sample(4)

                      name gender    race
6867          rahul pratap      m  indian
6976                 ankit      m  indian
4467  mahaveer singh yadav      m  indian
4982               shankar      m  indian

In [16]:
df1_2=pd.concat([df1,df2],axis=0)
df1_2.sample(4)

                 name gender    race
4493   vicky malhotra      m  indian
8839            amita      f  indian
14261       rajkumari      f  indian
1855   deepika sharma      f  indian

In [17]:
df1_2.gender.unique()

array(['f', 'm'], dtype=object)

In [18]:
df1_2=df1_2.drop('race',axis=1)

In [20]:
df1_2.gender=df1_2.gender.apply(lambda x: 0 if x.strip()=='f' else 1)

In [24]:
df1_2.sample(4)

                  name  gender
11339  rukhsana khatun       0
4121   mr. fateh singh       1
2120            sehnaj       0
9992             manoj       1

### new

In [26]:
df3=pd.read_csv("Indian-Name.csv")
df3.head()

      Name  Target  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5
0     Yash       1         NaN         NaN         NaN         NaN
1     Prit       1         NaN         NaN         NaN         NaN
2     Meet       1         NaN         NaN         NaN         NaN
3  Drashti       0         NaN         NaN         NaN         NaN
4   Saloni       0         NaN         NaN         NaN         NaN

In [27]:
df3=df3[df3.columns[0:2]]
df3.columns=col_names
df3.sample(4)

       name  gender
446  Sprash       1
633   Rinku       0
277  Nimesh       1
728   Nirav       1

### new

In [31]:
df4=pd.read_csv("name_gender_1950-2018.csv",header=None)
df4.columns=col_names
df4.head()

       name gender
0     Linda      F
1      Mary      F
2  Patricia      F
3   Barbara      F
4     Susan      F

In [32]:
df4.gender=df4.gender.apply(lambda x: 0 if x.strip()=='F' else 1)

In [33]:
df4.sample(4)

             name  gender
31554    Alejando       1
95647  Quinnleigh       0
45739     Latiana       0
48685       Edmar       1

### new

In [35]:
df5=pd.read_csv("name_gender_all.csv",header=None)
df5.columns=col_names
df5.head()

        name gender
0       Mary      F
1       Anna      F
2       Emma      F
3  Elizabeth      F
4     Minnie      F

In [37]:
df5.gender=df5.gender.apply(lambda x: 0 if x.strip()=='F' else 1)
df5.sample(4)

          name  gender
37956   Loukas       1
33912  Katrece       0
22524  Arcilia       0
68752  Rayquon       1

In [38]:
df6=pd.read_csv("name_gender_all.csv",header=None)
df6.columns=col_names
df6.head()

        name gender
0       Mary      F
1       Anna      F
2       Emma      F
3  Elizabeth      F
4     Minnie      F

In [39]:
df6.gender=df6.gender.apply(lambda x: 0 if x.strip()=='F' else 1)
df6.sample(4)

          name  gender
91097  Janayja       0
51715   Crosby       0
88996    Maeby       0
99907    Rozay       0

In [40]:
merged_names=pd.concat([df,df1_2,df3,df4,df5,df6],axis=0,ignore_index=True)

In [41]:
merged_names.shape

(353699, 2)

In [42]:
merged_names.sample(4)

            name  gender
18636     suresh       1
246127     Jones       1
282045  Shaunell       0
294833     Jaryn       1

In [81]:
len(merged_names.name.unique())

115098

In [82]:
gender_groups=merged_names.groupby('gender')

In [83]:
gender_groups.get_group(0).shape

(215598, 2)

In [84]:
unique_boys_names=gender_groups.get_group(1).name.unique()

In [85]:
len(unique_boys_names)

50909

In [86]:
gender_groups.get_group(1).shape

(138101, 2)

In [87]:
unique_girls_names=gender_groups.get_group(0).name.unique()
len(unique_girls_names)

75378

In [88]:
boys_df=pd.DataFrame(unique_boys_names,columns=['name'])
boys_df['gender']='m'
boys_df.sample(4)

                    name gender
21832              Ziyad      m
8629   veeri singh jatav      m
14260              Vaden      m
36231             Rhamir      m

In [89]:
girls_df=pd.DataFrame(unique_girls_names,columns=['name'])
girls_df['gender']='f'
girls_df.sample(4)

            name gender
18351       Shon      f
73397    Luethel      f
68958    Yashoda      f
17281  Marigrace      f

In [90]:
final_df=pd.concat([boys_df,girls_df],ignore_index=True)

In [106]:
final_df.sample(4)

           name gender
119060   Saanjh      f
105320  Jekayla      f
76988    Shazia      f
49413     Archa      m

In [108]:
final_df.to_csv('final_names',index=False)